In [1]:
import pandas as pd

In [2]:
ls

Data Via conti..ipynb              Probability Day 1.ipynb
Data Viz with seaborn.ipynb        Probability Day 2.ipynb
MatplotLib conti. + Seaborn.ipynb  directors.csv
Matplotlib.ipynb                   drive.google.com/
Matplotlib_Revision.ipynb          figure.png
Netflix project.ipynb              gapminder.csv
Pandas_4.ipynb                     jupyterthemes.ipynb
Pandas_5.ipynb                     movies.csv
Pandas_Rev_conti.ipynb             numpy_pandas_revision.ipynb
Pandas_Revision.ipynb              prob_01_basic_definitions/
Pfizer_1.csv

In [5]:
cd prob_01_basic_definitions

/Users/jitendranathmahato/Downloads/Scaler/prob_01_basic_definitions

In [6]:
ls

Sachin_ODI.csv                    prob_01_basic_definitions.pdf
covid.csv                         sachin.ipynb
post_read_covid_case_study.ipynb

In [8]:
df_sachin=pd.read_csv("Sachin_ODI.csv")
df_sachin.head(2)

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False

In [12]:
pd.crosstab(index=df_sachin["century"],columns=df_sachin["Won"],margins=True)

Won      False  True  All
century
False      160   154  314
True        16    30   46
All        176   184  360

In [13]:
df_century=df_sachin[df_sachin["century"]==True]
len(df_century)

46

In [14]:
df_win_given_century=df_century[df_century["Won"]==True]
len(df_win_given_century)

30

In [15]:
prob_win_given_century=len(df_win_given_century)/len(df_century)
prob_win_given_century

0.6521739130434783

In [16]:
df_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,True,False
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,True,False
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,False,False

In [19]:
df_sachin_vs_SF=df_sachin[df_sachin["Opp"]=="South Africa"]
len(df_sachin_vs_SF)

44

In [21]:
len(df_sachin_vs_SF[df_sachin_vs_SF["century"]==True])

5

In [22]:
5/44

0.11363636363636363

In [24]:
len(df_sachin[df_sachin["century"]==True])

46

In [27]:
44/46

0.9565217391304348

In [28]:
1-0.9565217391304348

0.04347826086956519

In [32]:
pd.crosstab(index=df_sachin["Opp"],columns=df_sachin["century"],margins=True)

century       False  True  All
Opp
Australia        53     8   61
Bangladesh        9     1   10
Bermuda           1     0    1
England          23     2   25
Ireland           2     0    2
Kenya             5     4    9
Namibia           0     1    1
Netherlands       2     0    2
New Zealand      28     4   32
Pakistan         54     5   59
South Africa     39     5   44
Sri Lanka        55     8   63
U.A.E.            1     0    1
West Indies      19     3   22
Zimbabwe         23     5   28
All             314    46  360